БИТУправление_медицинским_центром_демо/src/DataProcessors/СписаниеОстатковСертификатов/СписаниеОстатковСертификатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СписаниеОстатковСертификатов</name>
</mdclass:DataProcessor>

БИТУправление_медицинским_центром_демо/src/AccumulationRegisters/ОстаткиПоСертификатам/ОстаткиПоСертификатам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПоСертификатам</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПокупки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сертификат</name>
    <type>
      <types>CatalogRef.Сертификаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ИсторияПечатиОнлайнЧеков/ИсторияПечатиОнлайнЧеков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияПечатиОнлайнЧеков</name>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Результат</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДанныеXML</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СообщениеОтОборудования</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СторноОперация</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ВозвратПоПлатежнойКарте</types>
      <types>DocumentRef.ОказаниеУслуг</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.УдалитьКассовыйЧекКоррекции</types>
      <types>DocumentRef.ОплатаПлатежнойКартой</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодключаемоеОборудование</name>
    <type>
      <types>CatalogRef.ПодключаемоеОборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УИД</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Enums/СостоянияЧековККМ/СостоянияЧековККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияЧековККМ</name>
  <enumValues>
    <name>ЧекиПробиты</name>
  </enumValues>
  <enumValues>
    <name>ЧекиЧастичноПробиты</name>
  </enumValues>
  <enumValues>
    <name>ЧекиНеПробиты</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/ТипыСертификатов/ТипыСертификатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСертификатов</name>
  <enumValues>
    <name>НаУслуги</name>
  </enumValues>
  <enumValues>
    <name>НаОплату</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/ВидыОперацийОказанияУслуг/ВидыОперацийОказанияУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийОказанияУслуг</name>
  <enumValues>
    <name>ПродажаКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратКлиенту</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/ВидыНоменклатуры/ВидыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыНоменклатуры</name>
  <comment>Виды номенклатуры</comment>
  <enumValues>
    <name>Материал</name>
    <comment>Основной вид ТМЦ, учитываемый на складах</comment>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
    <comment>Услуга, не хранится на складах</comment>
  </enumValues>
  <enumValues>
    <name>Набор</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтактнойИнформации</name>
  <comment>Типы контактной информации</comment>
  <enumValues>
    <name>Телефон</name>
    <comment>Телефон</comment>
  </enumValues>
  <enumValues>
    <name>Адрес</name>
    <comment>Адрес</comment>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
    <comment>E-Mail</comment>
  </enumValues>
  <enumValues>
    <name>Skype</name>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
    <comment>Веб-страница</comment>
  </enumValues>
  <enumValues>
    <name>Факс</name>
  </enumValues>
  <enumValues>
    <name>Другое</name>
    <comment>Другая контактная информация (произвольная)</comment>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Catalogs/Сертификаты/Сертификаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сертификаты</name>
  <attributes>
    <name>ВидСертификата</name>
    <type>
      <types>CatalogRef.ВидыСертификатов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецКарты</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПродажи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Архив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РучноеРедактированиеВладельца</name>
    <comment>Владельца изменяли вручную. При перепроведении оказания услуг не требуется устанавливать</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РучноеРедактированиеДатыДействия</name>
    <comment>Дату начала действия изменяли вручную. При перепроведении оказания услуг не будет переустановлена.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Catalogs/ВидыСертификатов/ВидыСертификатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыСертификатов</name>
  <attributes>
    <name>Номинал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Именной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСертификата</name>
    <type>
      <types>EnumRef.ТипыСертификатов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьВыполнениеРаботВВыработку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаСуммыВыработки</name>
    <type>
      <types>EnumRef.СпособыРасчетаСтоимостиВыработкиПоРаботеАбонемента</types>
    </type>
  </attributes>
  <attributes>
    <name>Прейскурант</name>
    <type>
      <types>CatalogRef.Прейскуранты</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияВыработки</name>
    <type>
      <types>CatalogRef.КатегорииВыработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорогПредупрежденияОкончания</name>
    <comment>Остаток, начиная с которого выполняются предупреждения о завершении</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомплексныйСертификат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПополняемыйСертификат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПополнятьТолькоНоменклатуройСертификата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОграничиватьПоДнямНедели</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоминалРавенСтоимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПополнениеПоЦенеСертификата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаЦеныПриВозврате</name>
    <type>
      <types>EnumRef.СпособыРасчетаЦеныСертификатаПриВозврате</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Фильтр</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВремяПоДнямНедели</name>
    <comment>Время действия скидки</comment>
    <attributes>
      <name>Выбран</name>
      <comment>Признак выбранного дня недели</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДеньНедели</name>
      <comment>День недели</comment>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <comment>Время начала действия скидки</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <comment>Время окончания действия скидки</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/DataProcessors/СписаниеОстатковСертификатов/Forms/СписаниеОстатковСертификатов/Module.bsl
#Область РазделОписанияПеременных

&НаКлиенте
Перем ЛинейныйСписок;

&НаКлиенте
Перем ЧислоЧековНаПробитие;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Филиал = УправлениеНастройками.ПолучитьФилиалПоУмолчаниюПользователя(Пользователи.ТекущийПользователь());
	
	Дата = ТекущаяДата();
	
	ДнейДоОкончания = РаботаСФормамиСервер.ПолучитьНастройкуФормы("СписаниеСертификатов","СертфикатыДнейДоОкончания",7);
	ПочтаВЧеке = РаботаСФормамиСервер.ПолучитьНастройкуФормы("СписаниеСертификатов","ПочтаВЧеке","");
	
	ПечататьБумажныеЧеки = РаботаСФормамиСервер.ПолучитьНастройкуФормы("СписаниеСертификатов","ПечататьБумажныеЧеки",Ложь);
	Элементы.ПочтаВЧеке.Доступность = Не ПечататьБумажныеЧеки;
	
	Если ПочтаВЧеке = "" Тогда
		ПочтаВЧеке = ПолучитьEmailОганизации(Филиал);	
	КонецЕсли;
	
	ОбновитьСписки();
	
	ОтменаПробитияЧеков = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ГруппаСтраницыПриСменеСтраницы(Элементы.ГруппаСтраницы, Элементы.СписаниеСертификатов);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "УспешноеПробитиеЧекаОказаниеУслуг" 
		И ЛинейныйСписок <> Неопределено 
	Тогда
	
		Состояние("Пробитие чеков.",Окр(ЛинейныйСписок.Номер/ЧислоЧековНаПробитие * 100, 0)); 
		ОсновнаяТаблица = ?(Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "СписаниеСертификатов", Сертификаты, СписокДокументов);
		ДопТаблица = ?(ОсновнаяТаблица = Сертификаты, СписокДокументов, Сертификаты);
		ОсновнаяТаблица[ЛинейныйСписок.ИДСтроки].СостояниеЧеков = ПредопределенноеЗначение("Перечисление.СостоянияЧековККМ.ЧекиПробиты");
		СтрокиДопТаблицы = ДопТаблица.НайтиСтроки(Новый Структура("Документ", Параметр));
		Если СтрокиДопТаблицы.Количество() > 0 Тогда
			СтрокиДопТаблицы[0].СостояниеЧеков = ПредопределенноеЗначение("Перечисление.СостоянияЧековККМ.ЧекиПробиты");	
		КонецЕсли;
		
		ОбработкаПрерыванияПользователя();
		ПодключитьОбработчикОжидания("ПробитьЧекСледующегоДокумента", 0.1, Истина);	
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	СоздатьДокументыНаСервере(Истина);
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.НепробитыеЧекиДокументов;
	ГруппаСтраницыПриСменеСтраницы(Элементы.ГруппаСтраницы, Элементы.НепробитыеЧекиДокументов);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыНаСервере(ДобавлятьДокументВСписокДокументов = Ложь)
	
	МассивСертификатов = Сертификаты.Выгрузить(Новый Структура("Выбран", Истина),"Сертификат").ВыгрузитьКолонку("Сертификат");
	
	ОстаткиПоСертификатам = ПолучитьОстаткиПоСертификатам(МассивСертификатов);
	
	Для Каждого СтрокаСертификат Из Сертификаты Цикл
		Если СтрокаСертификат.Выбран И Не ЗначениеЗаполнено(СтрокаСертификат.Документ) Тогда
			ОстаткиПоСертификату = ОстаткиПоСертификатам.НайтиСтроки(Новый Структура("Сертификат", СтрокаСертификат.Сертификат));
			Если ОстаткиПоСертификату.Количество() > 0 Тогда
				СтрокаСертификат.Документ = СоздатьДокументОУ(СтрокаСертификат.Сертификат, СтрокаСертификат.ДокументПродажи, ОстаткиПоСертификату, ПечататьБумажныеЧеки, ПочтаВЧеке, Клиент, Врач, Касса, Склад, СкладМатериалов);
				Если ДобавлятьДокументВСписокДокументов Тогда 
					НоваяСтрока = СписокДокументов.Добавить();
					НоваяСтрока.Документ = СтрокаСертификат.Документ;
					НоваяСтрока.Филиал = НоваяСтрока.Документ.Филиал;
					// НоваяСтрока.Выбран = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	КоличествоНепробитых = СписокДокументов.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура ПробитьЧеки(Команда)
	
	Если Не ПечататьБумажныеЧеки И Не ЗначениеЗаполнено(ПочтаВЧеке) Тогда
		ПоказатьПредупреждение(, "Не указана электронная почта для фискализации без бумажного чека!");
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПочтаВЧеке)
		И Не ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(ПочтаВЧеке)
	Тогда
		ПоказатьПредупреждение(, "Указан некорректный адрес электронной почты!");
		Возврат;
	КонецЕсли;
	
	Если Вопрос("На выборанные документы будут пробиты кассовые чеки. Продолжить?", РежимДиалогаВопрос.ОКОтмена) <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	Номер = 1;
	ЧислоЧековНаПробитие = 0;
	ЛинейныйСписок = Неопределено;
	ЛинейныйСписок = Новый Структура("Следующий");
	Узел = ЛинейныйСписок;
	Таблица = ?(Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "СписаниеСертификатов", Сертификаты, СписокДокументов);
	Для ИндексСтроки = 0 По Таблица.Количество() - 1 Цикл
		СтрокаТаблицы = Таблица[ИндексСтроки];
		Если СтрокаТаблицы.Выбран
			И ЗначениеЗаполнено(СтрокаТаблицы.Документ) 
			И СтрокаТаблицы.СостояниеЧеков <> ПредопределенноеЗначение("Перечисление.СостоянияЧековККМ.ЧекиПробиты") 
		Тогда
			НовыйУзел = Новый Структура("Документ, ИДСтроки, Номер, Следующий", СтрокаТаблицы.Документ, ИндексСтроки, Номер);
			Узел.Следующий = НовыйУзел;
			Узел = Узел.Следующий;
			Номер = Номер + 1;
		КонецЕсли;	
	КонецЦикла;
	ЧислоЧековНаПробитие = Номер - 1;
	
	Оповещение = Новый ОписаниеОповещения("ЗакрытиеФормыОжидания", ЭтотОбъект);
	ОткрытьФорму("Обработка.СписаниеОстатковСертификатов.Форма.ОжиданиеПробитияЧеков",,ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	ПробитьЧекСледующегоДокумента();
	
	Состояние("Пробитие чеков.", 0);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьИПробить(Команда)
	
	СоздатьДокументыНаСервере();
	ПробитьЧеки(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	
	УстановитьПометки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	УстановитьПометки(Ложь);	
	
КонецПроцедуры

&НаКлиенте
Процедура ДвиженияПоСертификату(Команда)
	
	ЗначенияОтбора = Новый Структура("Сертификат", Элементы.Сертификаты.ТекущиеДанные.Сертификат);
	ОткрытьФорму("РегистрНакопления.ОстаткиПоСертификатам.ФормаСписка", Новый Структура("Отбор", ЗначенияОтбора));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСпискиНаФорме(Команда)
	ОбновитьСписки();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ОсновнаяСтраница = ТекущаяСтраница.Имя = "СписаниеСертификатов";
	
	Элементы.ФормаСоздатьДокументы.КнопкаПоУмолчанию = ОсновнаяСтраница;
	Элементы.ФормаПробитьЧеки.КнопкаПоУмолчанию	 = Не ОсновнаяСтраница;
	
КонецПроцедуры

&НаКлиенте
Процедура СертификатыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СертификатыПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СертификатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "СертификатыДокумент" Тогда
		Если ЗначениеЗаполнено(Элементы.Сертификаты.ТекущиеДанные.Документ) Тогда 
			ОткрытьФорму("Документ.ОказаниеУслуг.ФормаОбъекта", Новый Структура("Ключ", Элементы.Сертификаты.ТекущиеДанные.Документ));
		КонецЕсли;
	ИначеЕсли Поле.Имя = "СертификатыСертификат" Тогда
		ОткрытьФорму("Справочник.Сертификаты.ФормаОбъекта", Новый Структура("Ключ", Элементы.Сертификаты.ТекущиеДанные.Сертификат));	
	ИначеЕсли Поле.Имя = "СертификатыВидСертификата" Тогда
		ОткрытьФорму("Справочник.ВидыСертификатов.ФормаОбъекта", Новый Структура("Ключ", Элементы.Сертификаты.ТекущиеДанные.ВидСертификата));
	ИначеЕсли Поле.Имя = "СертификатыСуммаОстатка" Тогда
		ДвиженияПоСертификату(Неопределено);
	ИначеЕсли Поле.Имя = "СертификатыСостояниеЧеков" Тогда
		ЗначенияОтбора = Новый Структура("Документ", Элементы.Сертификаты.ТекущиеДанные.Документ);
		ОткрытьФорму("РегистрСведений.ИсторияПечатиОнлайнЧеков.ФормаСписка", Новый Структура("Отбор", ЗначенияОтбора));	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДнейДоОкончанияПриИзмененииНаСервере()
	
	ЗаполнитьСписокСертификатов();
	
	РаботаСФормамиСервер.СохранитьНастройкуФормы("СписаниеСертификатов","СертфикатыДнейДоОкончания",ДнейДоОкончания);
	
КонецПроцедуры

&НаКлиенте
Процедура ДнейДоОкончанияПриИзменении(Элемент) 
	
	ДнейДоОкончанияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "СписокДокументовДокумент" Тогда
		ОткрытьФорму("Документ.ОказаниеУслуг.ФормаОбъекта", Новый Структура("Ключ", Элементы.СписокДокументов.ТекущиеДанные.Документ));
	ИначеЕсли Поле.Имя = "СписокДокументовСостояниеЧеков" Тогда
		ЗначенияОтбора = Новый Структура("Документ", Элементы.СписокДокументов.ТекущиеДанные.Документ);
		ОткрытьФорму("РегистрСведений.ИсторияПечатиОнлайнЧеков.ФормаСписка", Новый Структура("Отбор", ЗначенияОтбора));	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ФилиалПриИзменении(Элемент)
	
	ОбновитьСписки();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПечататьБумажныеЧекиПриИзмененииНаСервере(ПечататьБумажныеЧеки)
	
	РаботаСФормамиСервер.СохранитьНастройкуФормы("СписаниеСертификатов","ПечататьБумажныеЧеки",ПечататьБумажныеЧеки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечататьБумажныеЧекиПриИзменении(Элемент)
	
	Элементы.ПочтаВЧеке.Доступность = Не ПечататьБумажныеЧеки;
	ПечататьБумажныеЧекиПриИзмененииНаСервере(ПечататьБумажныеЧеки);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&НаСервере
Процедура ЗаполнитьСписокСертификатов()
	
	Сертификаты.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ОстаткиПоСертификатамОстатки.Сертификат КАК Сертификат
	               |ПОМЕСТИТЬ ОстаткиПоНенулевымСертификатам
	               |ИЗ
	               |	РегистрНакопления.ОстаткиПоСертификатам.Остатки КАК ОстаткиПоСертификатамОстатки
	               |ГДЕ
	               |	ОстаткиПоСертификатамОстатки.СуммаПокупкиОстаток > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОстаткиПоСертификатам.Сертификат КАК Сертификат,
	               |	МИНИМУМ(ОстаткиПоСертификатам.Период) КАК ПерваяПродажа
	               |ПОМЕСТИТЬ ПервыеПродажиСертификатов
	               |ИЗ
	               |	ОстаткиПоНенулевымСертификатам КАК ОстаткиПоНенулевымСертификатам
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиПоСертификатам КАК ОстаткиПоСертификатам
	               |		ПО ОстаткиПоНенулевымСертификатам.Сертификат = ОстаткиПоСертификатам.Сертификат
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОстаткиПоСертификатам.Сертификат
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОстаткиПоСертификатамОстатки.Сертификат КАК Сертификат,
	               |	СУММА(ОстаткиПоСертификатамОстатки.СуммаОстаток) КАК СуммаОстаток,
	               |	СУММА(ОстаткиПоСертификатамОстатки.СуммаПокупкиОстаток) КАК СуммаПокупкиОстаток,
	               |	ОстаткиПоСертификатамОстатки.Сертификат.ДатаНачалаДействия КАК ДатаНачалаДействия,
	               |	ОстаткиПоСертификатамОстатки.Сертификат.ВидСертификата.СрокДействия КАК СрокДействия
	               |ПОМЕСТИТЬ ОстаткиПоСертификатам
	               |ИЗ
	               |	РегистрНакопления.ОстаткиПоСертификатам.Остатки КАК ОстаткиПоСертификатамОстатки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПервыеПродажиСертификатов КАК ПервыеПродажиСертификатов
	               |		ПО (ПервыеПродажиСертификатов.Сертификат = ОстаткиПоСертификатамОстатки.Сертификат)
	               |ГДЕ
	               |	ОстаткиПоСертификатамОстатки.Сертификат.ВидСертификата.ТипСертификата = ЗНАЧЕНИЕ(Перечисление.ТипыСертификатов.НаУслуги)
	               |	И НЕ ОстаткиПоСертификатамОстатки.Сертификат.ПометкаУдаления
	               |	И ПервыеПродажиСертификатов.ПерваяПродажа >= &ДатаНачалаРаботыПоСхемеАБ_4_20_13041
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОстаткиПоСертификатамОстатки.Сертификат,
	               |	ОстаткиПоСертификатамОстатки.Сертификат.ДатаНачалаДействия,
	               |	ОстаткиПоСертификатамОстатки.Сертификат.ВидСертификата.СрокДействия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОстаткиПоСертификатам.Сертификат КАК Сертификат,
	               |	МИНИМУМ(ОстаткиПоСертификатам.Период) КАК Период
	               |ПОМЕСТИТЬ ПервыеПродажи
	               |ИЗ
	               |	РегистрНакопления.ОстаткиПоСертификатам КАК ОстаткиПоСертификатам
	               |ГДЕ
	               |	ОстаткиПоСертификатам.Сертификат.ДатаНачалаДействия >= &ДатаНачалаРаботыПоСхемеАБ_4_20_13041
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОстаткиПоСертификатам.Сертификат
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ПервыеПродажи.Сертификат КАК Сертификат,
	               |	ОстаткиПоСертификатам.Регистратор КАК Регистратор
	               |ПОМЕСТИТЬ ПервыеПродажиСРегистратором
	               |ИЗ
	               |	РегистрНакопления.ОстаткиПоСертификатам КАК ОстаткиПоСертификатам
	               |		ПРАВОЕ СОЕДИНЕНИЕ ПервыеПродажи КАК ПервыеПродажи
	               |		ПО ОстаткиПоСертификатам.Сертификат = ПервыеПродажи.Сертификат
	               |			И ОстаткиПоСертификатам.Период = ПервыеПродажи.Период
	               |ГДЕ
	               |	ОстаткиПоСертификатам.Регистратор.Дата >= &ДатаНачалаРаботыПоСхемеАБ_4_20_13041
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ОстаткиПоСертификатам.Сертификат КАК Сертификат,
	               |	ОстаткиПоСертификатам.СуммаОстаток КАК СуммаОстаток,
	               |	ОстаткиПоСертификатам.СуммаПокупкиОстаток КАК СуммаПокупкиОстаток,
	               |	ОстаткиПоСертификатам.ДатаНачалаДействия КАК ДатаНачалаДействия,
	               |	ОстаткиПоСертификатам.СрокДействия КАК СрокДействия,
	               |	ПервыеПродажиСРегистратором.Регистратор КАК Регистратор
	               |ИЗ
	               |	ОстаткиПоСертификатам КАК ОстаткиПоСертификатам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПервыеПродажиСРегистратором КАК ПервыеПродажиСРегистратором
	               |		ПО ОстаткиПоСертификатам.Сертификат = ПервыеПродажиСРегистратором.Сертификат
	               |ГДЕ
	               |	(ПервыеПродажиСРегистратором.Регистратор.Филиал = &Филиал
	               |			ИЛИ &Филиал = НЕОПРЕДЕЛЕНО)";
	
	Запрос.УстановитьПараметр("ДатаНачалаРаботыПоСхемеАБ_4_20_13041", Константы.ДатаНачалаРаботыСАбонементамиПоСхемеАБ_4_20_13041.Значение());
	Запрос.УстановитьПараметр("Филиал", ?(Филиал.Пустая(), Неопределено, Филиал));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДатаОкончания = ?(ТипЗнч(Выборка.СрокДействия) = Тип("Дата"),Выборка.СрокДействия, ДобавитьМесяц(Выборка.ДатаНачалаДействия, Выборка.СрокДействия));
		Если ДатаОкончания - ДнейДоОкончания * 86400 < ТекущаяДата() Тогда
			НоваяСтрока = Сертификаты.Добавить();
			НоваяСтрока.Сертификат = Выборка.Сертификат;
			НоваяСтрока.ВидСертификата = НоваяСтрока.Сертификат.ВидСертификата;
			НоваяСтрока.СуммаОстатка = Выборка.СуммаПокупкиОстаток;
			НоваяСтрока.ДокументПродажи = Выборка.Регистратор;
			НоваяСтрока.Филиал = НоваяСтрока.ДокументПродажи.Филиал;
			НоваяСтрока.ДатаОкончания = ДатаОкончания;
			НоваяСтрока.Выбран = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Сертификаты.Сортировать("ДатаОкончания, ВидСертификата");
	
	КоличествоНаСписание = Сертификаты.Количество();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДокументов()
	
	СписокДокументов.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОказаниеУслугРаботы.Ссылка КАК Ссылка,
	               |	ОказаниеУслугРаботы.Сертификат КАК Сертификат
	               |ПОМЕСТИТЬ ОказаниеУслугРаботы
	               |ИЗ
	               |	Документ.ОказаниеУслуг.Работы КАК ОказаниеУслугРаботы
	               |ГДЕ
	               |	ОказаниеУслугРаботы.Сертификат <> ЗНАЧЕНИЕ(Справочник.Сертификаты.ПустаяСсылка)
	               |	И ОказаниеУслугРаботы.Ссылка.СостояниеЧековККМ = ЗНАЧЕНИЕ(Перечисление.СостоянияЧековККМ.ЧекиНеПробиты)
	               |	И НЕ ОказаниеУслугРаботы.Ссылка.ПометкаУдаления
	               |	И ОказаниеУслугРаботы.Ссылка.Проведен
	               |	И (ОказаниеУслугРаботы.Ссылка.Филиал = &Филиал
	               |			ИЛИ &Филиал = НЕОПРЕДЕЛЕНО)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОказаниеУслугРаботы.Сертификат КАК Сертификат,
	               |	МИНИМУМ(ОстаткиПоСертификатам.Период) КАК Период
	               |ПОМЕСТИТЬ ПервыеПродажиСертификатов
	               |ИЗ
	               |	ОказаниеУслугРаботы КАК ОказаниеУслугРаботы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиПоСертификатам КАК ОстаткиПоСертификатам
	               |		ПО ОказаниеУслугРаботы.Сертификат = ОстаткиПоСертификатам.Сертификат
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОказаниеУслугРаботы.Сертификат
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОказаниеУслугРаботы.Ссылка КАК Ссылка
	               |ИЗ
	               |	ОказаниеУслугРаботы КАК ОказаниеУслугРаботы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПервыеПродажиСертификатов КАК ПервыеПродажиСертификатов
	               |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиПоСертификатам КАК ОстаткиПоСертификатам
	               |			ПО ПервыеПродажиСертификатов.Сертификат = ОстаткиПоСертификатам.Сертификат
	               |				И ПервыеПродажиСертификатов.Период = ОстаткиПоСертификатам.Период
	               |		ПО ОказаниеУслугРаботы.Сертификат = ПервыеПродажиСертификатов.Сертификат
	               |ГДЕ
	               |	ОстаткиПоСертификатам.Регистратор.Дата >= &ДатаНачалаРаботыПоСхемеАБ_4_20_13041";
	
	Запрос.УстановитьПараметр("ДатаНачалаРаботыПоСхемеАБ_4_20_13041", Константы.ДатаНачалаРаботыСАбонементамиПоСхемеАБ_4_20_13041.Значение());
	Запрос.УстановитьПараметр("Филиал", ?(Филиал.Пустая(), Неопределено, Филиал));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = СписокДокументов.Добавить();
		НоваяСтрока.Документ = Выборка.Ссылка;
		НоваяСтрока.Филиал = НоваяСтрока.Документ.Филиал;
		// НоваяСтрока.Выбран = Истина;
	КонецЦикла;
	
	КоличествоНепробитых = СписокДокументов.Количество();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьДокументОУ(Сертификат, ДокументПродажи, ОстаткиПоСертификату, ПечататьБумажныеЧеки, ПочтаВЧеке, Клиент = Неопределено, Врач = Неопределено, Касса = Неопределено, Склад = Неопределено, СкладМатериалов = Неопределено)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Документ = Документы.ОказаниеУслуг.СоздатьДокумент();
	Документ.Дата = ТекущаяДата(); 
	Документ.Филиал = ДокументПродажи.Филиал;
	Документ.Клиент = ?(ЗначениеЗаполнено(Клиент), Клиент, Сертификат.ВладелецКарты);
	Документ.Сотрудник = ?(ЗначениеЗаполнено(Врач),Врач,ДокументПродажи.Сотрудник);
	Документ.Ответственный = Пользователи.ТекущийПользователь();
	Документ.ВидОперации = Перечисления.ВидыОперацийОказанияУслуг.ПродажаКлиенту;
	Документ.Касса = ?(ЗначениеЗаполнено(Касса),Касса,ДокументПродажи.Касса);
	Документ.Склад = ?(ЗначениеЗаполнено(Склад), Склад,ДокументПродажи.Склад);
	Документ.СкладМатериалов = ?(ЗначениеЗаполнено(СкладМатериалов), СкладМатериалов, ДокументПродажи.СкладМатериалов);
	Документ.Комментарий = "Создан автоматически для погашения просроченного сертификата на услуги: " + Строка(Сертификат);
	
	Если Не ПечататьБумажныеЧеки Тогда
		Документ.АдресEmailЧек = ПочтаВЧеке;
	КонецЕсли;
	
	Если Сертификат.ВидСертификата.КомплексныйСертификат Тогда
		Для Каждого Остаток Из ОстаткиПоСертификату Цикл
			СтрокаРаботы = Документ.Работы.Добавить();
			СтрокаРаботы.Номенклатура = Остаток.Номенклатура;
			СтрокаРаботы.Количество = Остаток.Количество;
            СтрокаРаботы.Сертификат = Сертификат;
		КонецЦикла;
	Иначе
		Остаток = ОстаткиПоСертификату[0].Количество;
		НераспределеноУслуг = Сертификат.ВидСертификата.Услуги.Количество();
		Для Каждого Услуга Из Сертификат.ВидСертификата.Услуги Цикл
			Если Остаток = 0 Тогда
				Прервать;
			КонецЕсли;
			Количество = Остаток / НераспределеноУслуг;
			СтрокаРаботы = Документ.Работы.Добавить();
			
			Если Услуга.Фильтр.ЭтоГруппа Тогда
				СтрокаРаботы.Номенклатура = ПолучитьУслугуГруппы(Услуга.Фильтр);
			Иначе			
				СтрокаРаботы.Номенклатура = Услуга.Фильтр;
			КонецЕсли;
			
			СтрокаРаботы.Количество = ?(Окр(Количество, 0) < Количество, Окр(Количество, 0) + 1, Окр(Количество, 0));
			СтрокаРаботы.Сертификат = Сертификат;
			Остаток = Остаток - СтрокаРаботы.Количество;
			НераспределеноУслуг = НераспределеноУслуг - 1;
		КонецЦикла;
	КонецЕсли;
	
	Документ.ДополнительныеСвойства.Вставить("СписаниеСертификатов", Истина);
	
	Попытка
		Документ.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ВызватьИсключение "Не удалось провести документ погашения. Проверьте причину в информационных сообщениях" + Символы.ПС + ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Документ.Ссылка;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОстаткиПоСертификатам(МассивСертификатов)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОстаткиПоСертификатамОстатки.Сертификат КАК Сертификат,
	               |	ОстаткиПоСертификатамОстатки.Номенклатура КАК Номенклатура,
	               |	ОстаткиПоСертификатамОстатки.СуммаОстаток КАК Количество,
	               |	ОстаткиПоСертификатамОстатки.СуммаПокупкиОстаток КАК Сумма
	               |ИЗ
	               |	РегистрНакопления.ОстаткиПоСертификатам.Остатки КАК ОстаткиПоСертификатамОстатки
	               |ГДЕ
	               |	ОстаткиПоСертификатамОстатки.Сертификат В(&МассивСертификатов)";
	
	Запрос.УстановитьПараметр("МассивСертификатов", МассивСертификатов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьУслугуГруппы(ГруппаНоменклатуры)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Родитель", ГруппаНоменклатуры);
	Запрос.УстановитьПараметр("ВидНоменклатуры", Перечисления.ВидыНоменклатуры.Услуга);
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Номенклатура.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Родитель = &Родитель
	|	И Номенклатура.ВидНоменклатуры = &ВидНоменклатуры"	
	;
	Выб = Запрос.Выполнить().Выбрать();
	Если Выб.Следующий() Тогда
		Возврат Выб.Ссылка;
	Иначе
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура УстановитьПометки(Пометка)
	
	Таблица = ?(Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя = "СписаниеСертификатов", Сертификаты, СписокДокументов);
	Для Каждого СтрокаТаблицы Из Таблица Цикл
		СтрокаТаблицы.Выбран = Пометка;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ПробитьЧекСледующегоДокумента() Экспорт
	
	ЛинейныйСписок = ЛинейныйСписок.Следующий;
	Если ЛинейныйСписок <> Неопределено И Не ОтменаПробитияЧеков Тогда 
		ОткрытьФорму("Документ.ОказаниеУслуг.ФормаОбъекта", Новый Структура("Ключ, АвтоПробитиеЧека", ЛинейныйСписок.Документ, Истина),,,,,, РежимОткрытияОкнаФормы.Независимый);
	Иначе
		Оповестить("ВсеЧекиПробиты");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьEmailОганизации(Филиал)
	
	Возврат КонтактнаяИнформацияСерверПереопределяемый.НайтиКонтактнуюИнформацию(Филиал, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,,Истина);
	
КонецФункции
		
&НаСервере
Процедура ЗаполнитьСписокВыбораEmail()
	
	Элементы.ПочтаВЧеке.СписокВыбора.Очистить();
	
	АдресаПочты = Новый Массив;
	
	Филиалы = Справочники.Филиалы.Выбрать();
	Пока Филиалы.Следующий() Цикл
		Почта = ПолучитьEmailОганизации(Филиалы.Ссылка);
		Если ЗначениеЗаполнено(Почта) Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьВМассивБезДублей(АдресаПочты, Почта);
		КонецЕсли;
		
		Почта = ПолучитьEmailОганизации(Филиалы.Организация);
		Если ЗначениеЗаполнено(Почта) Тогда
			ОбщегоНазначенияКлиентСервер.ДобавитьВМассивБезДублей(АдресаПочты, Почта);
		КонецЕсли;
	КонецЦикла;
	
	Элементы.ПочтаВЧеке.СписокВыбора.ЗагрузитьЗначения(АдресаПочты);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТаблицуДатПервыхПокупокСертификатов()
	
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ОстаткиПоСертификатамОстатки.Сертификат КАК Сертификат
	               |ПОМЕСТИТЬ ОстаткиПоНенулевымСертификатам
	               |ИЗ
	               |	РегистрНакопления.ОстаткиПоСертификатам.Остатки КАК ОстаткиПоСертификатамОстатки
	               |ГДЕ
	               |	ОстаткиПоСертификатамОстатки.СуммаПокупкиОстаток > 0
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОстаткиПоСертификатам.Сертификат КАК Сертификат,
	               |	МИНИМУМ(ОстаткиПоСертификатам.Период) КАК ПерваяПродажа
	               |ПОМЕСТИТЬ ПервыеПродажиСертификатов
	               |ИЗ
	               |	ОстаткиПоНенулевымСертификатам КАК ОстаткиПоНенулевымСертификатам
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиПоСертификатам КАК ОстаткиПоСертификатам
	               |		ПО ОстаткиПоНенулевымСертификатам.Сертификат = ОстаткиПоСертификатам.Сертификат
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ОстаткиПоСертификатам.Сертификат";
	
	Запрос.Выполнить();
	
	Возврат МВТ;
	
КонецФункции

&НаСервере
Процедура ОбновитьСписки()
	
	ЗаполнитьСписокСертификатов();
	ЗаполнитьСписокДокументов();	
	ЗаполнитьСписокВыбораEmail();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормыОжидания(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = "Отмена" Тогда 
		ОтменаПробитияЧеков = Истина;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
